OpenHMR/Open-HMR600/Src/linux-2.6.12/drivers/net/wireless/realtek/rtl8712/os_intf/linux/usb_intf.c
	pdvobjpriv->nr_endpoint = piface_desc->bNumEndpoints;
	

	//printk("\ndump 8712_usb_endpoint_descriptor:\n");

	for(i=0; i<pdvobjpriv->nr_endpoint; i++)
	{
		phost_endp = phost_iface->endpoint+i;
		if(phost_endp)
		{
			pendp_desc = &phost_endp->desc;
		
			printk("\n8712_usb_endpoint_descriptor(%d):\n", i);
			printk("bLength=%x\n",pendp_desc->bLength);
			printk("bDescriptorType=%x\n",pendp_desc->bDescriptorType);
			printk("bEndpointAddress=%x\n",pendp_desc->bEndpointAddress);
			//printk("bmAttributes=%x\n",pendp_desc->bmAttributes);
			//printk("wMaxPacketSize=%x\n",pendp_desc->wMaxPacketSize);
			printk("wMaxPacketSize=%x\n",le16_to_cpu(pendp_desc->wMaxPacketSize));
			printk("bInterval=%x\n",pendp_desc->bInterval);
			//printk("bRefresh=%x\n",pendp_desc->bRefresh);
			//printk("bSynchAddress=%x\n",pendp_desc->bSynchAddress);	
		}	

	}

	printk("\n");
	
	if (pusbd->speed==USB_SPEED_HIGH)
	{
                pdvobjpriv->ishighspeed = _TRUE;
                printk("8712u : USB_SPEED_HIGH\n");
	}
	else
	{
		 pdvobjpriv->ishighspeed = _FALSE;
                 printk("8712u: NON USB_SPEED_HIGH\n");
	}
	  	
			
	printk("nr_endpoint=%d\n", pdvobjpriv->nr_endpoint);
	  	
	if ( (alloc_io_queue(padapter)) == _FAIL)
	{
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,(" \n Can't init io_reqs\n"));
		status = _FAIL;			
	}	
	
	_init_sema(&(padapter->dvobjpriv.usb_suspend_sema), 0);


_func_exit_;
	
	return status;


}

void usb_dvobj_deinit(_adapter * padapter){
	
	struct dvobj_priv *pdvobjpriv=&padapter->dvobjpriv;

	_func_enter_;


	_func_exit_;
}

void rtl871x_intf_stop(_adapter *padapter)
{
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+rtl871x_intf_stop\n"));
	
	//disabel_hw_interrupt
	if(padapter->bSurpriseRemoved == _FALSE)
	{
		//device still exists, so driver can do i/o operation
		//TODO:
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("SurpriseRemoved==_FALSE\n"));
	}
	
	//cancel in irp
	if(padapter->dvobjpriv.inirp_deinit !=NULL)
	{	
		padapter->dvobjpriv.inirp_deinit(padapter);	
	}	

	//cancel out irp
	usb_write_port_cancel(padapter);


	//todo:cancel other irps

	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-rtl871x_intf_stop\n"));

}

#if 0
void r871x_dev_unload(_adapter *padapter)
{
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+r871x_dev_unload\n"));

	if(padapter->bSurpriseRemoved == _TRUE)
	{		
		padapter->bDriverStopped = _TRUE;
	
		RT_TRACE(_module_os_intfs_c_, _drv_info_, ("padapter->bSurpriseRemoved==_TRUE\n"));
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("unload -> surprise removed\n"));
		
		free_drv_sw(padapter);
		
		return;

	}
					
       padapter->bDriverStopped = _TRUE;
	padapter->bSurpriseRemoved = _TRUE;   

	rtl871x_intf_stop(padapter);

	stop_drv_threads(padapter);

	rtl871x_hal_deinit(padapter);

	
	if(padapter->dvobj_deinit)
	{
		padapter->dvobj_deinit(padapter);
		
	}else
	{
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("Initialize hcipriv.hci_priv_init error!!!\n"));
	}			
	
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-r871x_dev_unload\n"));
}
#else
void r871x_dev_unload(_adapter *padapter)
{
	struct net_device *pnetdev= (struct net_device*)padapter->pnetdev;

	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+r871x_dev_unload\n"));

	if(padapter->bup == _TRUE)
	{
		printk("+r871x_dev_unload\n");
		//s1.
/*		if(pnetdev)   
     		{
        		netif_carrier_off(pnetdev);
     	  		netif_stop_queue(pnetdev);
     		}
		
		//s2.
		//s2-1.  issue disassoc_cmd to fw
		disassoc_cmd(padapter);	
		//s2-2.  indicate disconnect to os
		indicate_disconnect(padapter);				
		//s2-3. 
	       free_assoc_resources(padapter);	
		//s2-4.
		free_network_queue(padapter);*/

		padapter->bDriverStopped = _TRUE;
	
		//s3.
		rtl871x_intf_stop(padapter);

		//s4.
		stop_drv_threads(padapter);


		//s5.
		if(padapter->bSurpriseRemoved == _FALSE)
		{
			printk("r871x_dev_unload()->rtl871x_hal_deinit()\n");
			rtl871x_hal_deinit(padapter);

			//padapter->bSurpriseRemoved = _TRUE;
		}	

		//s6.	
		if(padapter->dvobj_deinit)
		{
			padapter->dvobj_deinit(padapter);
		
		}
		else
		{
			RT_TRACE(_module_hci_intfs_c_,_drv_err_,("Initialize hcipriv.hci_priv_init error!!!\n"));
		}			
		
		padapter->bup = _FALSE;

	}
	else
	{
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("r871x_dev_unload():padapter->bup == _FALSE\n" ));
	}
				
	printk("-r871x_dev_unload\n");		
	
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-r871x_dev_unload\n"));
	
}
#endif

static void disable_ht_for_spec_devid(const struct usb_device_id *pdid)
{
#ifdef CONFIG_80211N_HT
	u16 vid, pid;
	u32 flags;
	int i;	
	int num = sizeof(specific_device_id_tbl)/sizeof(struct specific_device_id);

	for(i=0; i<num; i++)
	{
		vid = specific_device_id_tbl[i].idVendor;
		pid = specific_device_id_tbl[i].idProduct;
		flags = specific_device_id_tbl[i].flags;

		if((pdid->idVendor==vid) && (pdid->idProduct==pid) && (flags&SPEC_DEV_ID_DISABLE_HT))
		{
			 ht_enable = 0;            
			 cbw40_enable = 0;            
			 ampdu_enable = 0;			
		}
	}
#endif
}

u8 key_char2num(u8 ch)
{
    if((ch>='0')&&(ch<='9'))
        return ch - '0';
    else if ((ch>='a')&&(ch<='f'))
        return ch - 'a' + 10;
    else if ((ch>='A')&&(ch<='F'))
        return ch - 'A' + 10;
    else
	 return 0xff;
}

u8 key_2char2num(u8 hch, u8 lch)
{
    return ((key_char2num(hch) << 4) | key_char2num(lch));
}


/*
 * drv_init() - a device potentially for us
 *
 * notes: drv_init() is called when the bus driver has located a card for us to support.
 *        We accept the new device by returning 0.
*/
static int r871xu_drv_init(struct usb_interface *pusb_intf,const struct usb_device_id *pdid)
{  	
  	uint status;	 
	_adapter *padapter = NULL;
  	struct dvobj_priv *pdvobjpriv;
	struct net_device *pnetdev;
	struct usb_device	*udev;

	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+871x - drv_init\n"));

	printk( "==DriverVersion: %s==\n", DRVER );

	//2009.8.13, by Thomas
	// In this probe function, O.S. will provide the usb interface pointer to driver.
	// We have to increase the reference count of the usb device structure by using the usb_get_dev function.
	udev = interface_to_usbdev(pusb_intf);
	usb_get_dev(udev);

