OpenHMR/Open-HMR600/Src/linux-2.6.12/drivers/net/wireless/realtek/rtl8712/os_intf/linux/usb_intf.c
	pintf = pusb_intf;

#ifdef CONFIG_80211N_HT
	//step 0.	
	disable_ht_for_spec_devid(pdid);
#endif

	//step 1.
	pnetdev = init_netdev();
	if (!pnetdev)
		goto error;	
	
	padapter = netdev_priv(pnetdev);
	pdvobjpriv = &padapter->dvobjpriv;	
	pdvobjpriv->padapter = padapter;

	padapter->dvobjpriv.pusbdev = udev;
	usb_set_intfdata(pusb_intf, pnetdev);	
	SET_NETDEV_DEV(pnetdev, &pusb_intf->dev);

	//step 2.
	padapter->dvobj_init=&usb_dvobj_init;
	padapter->dvobj_deinit=&usb_dvobj_deinit;
	padapter->halpriv.hal_bus_init=&usb_hal_bus_init;
	padapter->halpriv.hal_bus_deinit=&usb_hal_bus_deinit;	
	padapter->dvobjpriv.inirp_init=&usb_inirp_init;
	padapter->dvobjpriv.inirp_deinit=&usb_inirp_deinit;

	//step 3.
	//initialize the dvobj_priv 		
	if(padapter->dvobj_init ==NULL){
			RT_TRACE(_module_hci_intfs_c_,_drv_err_,("\n Initialize dvobjpriv.dvobj_init error!!!\n"));
			goto error;
	}else{
	
		status=padapter->dvobj_init(padapter);
		if (status != _SUCCESS) {
			RT_TRACE(_module_hci_intfs_c_,_drv_err_,("\n initialize device object priv Failed!\n"));			
			goto error;
		} 
	}

	//step 4.
	status = init_drv_sw(padapter);	
	if(status ==_FAIL){
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("Initialize driver software resource Failed!\n"));	
		goto error;					
	}	

#if 1
	//step 5. read efuse/eeprom data and get mac_addr
	{
		int i, offset;
		u8 mac[6];
		u8	tmpU1b, AutoloadFail, eeprom_CustomerID;
		u8 *pdata = padapter->eeprompriv.efuse_eeprom_data;

		tmpU1b = read8(padapter, EE_9346CR);//CR9346	

		// To check system boot selection.
		if (tmpU1b & _9356SEL)
		{
			printk("Boot from EEPROM\n");
		}
		else 
		{
			printk("Boot from EFUSE\n");
		}	

		// To check autoload success or not.
		if (tmpU1b & _EEPROM_EN)
		{
			printk("Autoload OK!!\n");
			AutoloadFail = _TRUE;

			//
			// <Roger_Note> The following operation are prevent Efuse leakage by turn on 2.5V.
			// 2008.11.25.
			//
			tmpU1b = read8(padapter, EFUSE_TEST+3);
			write8(padapter, EFUSE_TEST+3, tmpU1b|0x80);
			mdelay_os(1);
			write8(padapter, EFUSE_TEST+3, (tmpU1b&(~ BIT(7))));

			// Retrieve Chip version.
			// 20090915 Joseph: Recognize IC version by Reg0x4 BIT15.
			tmpU1b = (u8)((read32(padapter, PMC_FSM)>>15)&0x1F);

			if(tmpU1b==0x3)
				padapter->registrypriv.chip_version = RTL8712_3rdCUT;
			else
				padapter->registrypriv.chip_version = (tmpU1b>>1)+1;

			switch(padapter->registrypriv.chip_version)
			{
				case RTL8712_1stCUT:
					RT_TRACE(_module_hci_intfs_c_,_drv_err_,("Chip Version ID: RTL8712_1stCUT.\n"));
					break;
				case RTL8712_2ndCUT:
					RT_TRACE(_module_hci_intfs_c_,_drv_err_,("Chip Version ID: RTL8712_2ndCUT.\n"));
					break;
				case RTL8712_3rdCUT:
					RT_TRACE(_module_hci_intfs_c_,_drv_err_,("Chip Version ID: RTL8712_3rdCUT.\n"));
					break;
				default:
					RT_TRACE(_module_hci_intfs_c_,_drv_err_,("Unknown Chip Version!!\n"));
					padapter->registrypriv.chip_version = RTL8712_2ndCUT;
					break;
			}
			
#if 1

			for(i=0, offset=0 ; i<128; i+=8, offset++)
			{
				efuse_pg_packet_read(padapter, offset, &pdata[i]);			
			}

			if ( initmac )
			{	//	Users specify the mac address
				int jj,kk;

				for( jj = 0, kk = 0; jj < ETH_ALEN; jj++, kk += 3 )
				{
	            			mac[jj] = key_2char2num(initmac[kk], initmac[kk+ 1]);
				}
			}
			else
			{	//	Use the mac address stored in the Efuse
			 	_memcpy(mac, &pdata[0x12], ETH_ALEN);//offset = 0x12 for usb in efuse 
			}


			eeprom_CustomerID = pdata[0x52];
			switch(eeprom_CustomerID)
			{
				case EEPROM_CID_ALPHA:
					padapter->eeprompriv.CustomerID = RT_CID_819x_ALPHA;
					break;
					
				case EEPROM_CID_CAMEO:
					padapter->eeprompriv.CustomerID = RT_CID_819x_CAMEO;
					break;			
					
				case EEPROM_CID_SITECOM:
					padapter->eeprompriv.CustomerID = RT_CID_819x_Sitecom;
					break;	
					
				case EEPROM_CID_COREGA:
					padapter->eeprompriv.CustomerID = RT_CID_COREGA;						
					break;			
			
				case EEPROM_CID_Senao:
					padapter->eeprompriv.CustomerID = RT_CID_819x_Senao;
					break;
		
				case EEPROM_CID_EDIMAX_BELKIN:
					padapter->eeprompriv.CustomerID = RT_CID_819x_Edimax_Belkin;
					break;
		
				case EEPROM_CID_SERCOMM_BELKIN:
					padapter->eeprompriv.CustomerID = RT_CID_819x_Sercomm_Belkin;
					break;
					
				case EEPROM_CID_WNC_COREGA:
					padapter->eeprompriv.CustomerID = RT_CID_819x_WNC_COREGA;
					break;
		
				case EEPROM_CID_WHQL:
					break;
					
				case EEPROM_CID_NetCore:
					padapter->eeprompriv.CustomerID = RT_CID_819x_Netcore;
					break;
		
				case EEPROM_CID_CAMEO1:
					padapter->eeprompriv.CustomerID = RT_CID_819x_CAMEO1;
					break;
					
				case EEPROM_CID_CLEVO:
					padapter->eeprompriv.CustomerID = RT_CID_819x_CLEVO;
					break;
		
				default:
					padapter->eeprompriv.CustomerID = RT_CID_DEFAULT;
					break;
					
			}
			printk("CustomerID = 0x%4x\n", padapter->eeprompriv.CustomerID);

			//
			// Led mode
			// 
			switch(padapter->eeprompriv.CustomerID)
			{
				case RT_CID_DEFAULT:
				case RT_CID_819x_ALPHA:
				case RT_CID_819x_CAMEO:
					padapter->ledpriv.LedStrategy = SW_LED_MODE1;
					padapter->ledpriv.bRegUseLed = _TRUE;
					break;	

				case RT_CID_819x_Sitecom:
					padapter->ledpriv.LedStrategy = SW_LED_MODE2;
					padapter->ledpriv.bRegUseLed = _TRUE;
					break;	

				case RT_CID_COREGA:
				case RT_CID_819x_Senao:
					padapter->ledpriv.LedStrategy = SW_LED_MODE3;
					padapter->ledpriv.bRegUseLed = _TRUE;
					break;			

				case RT_CID_819x_Edimax_Belkin:
					padapter->ledpriv.LedStrategy = SW_LED_MODE4;
					padapter->ledpriv.bRegUseLed = _TRUE;
					break;					

				case RT_CID_819x_Sercomm_Belkin:
					padapter->ledpriv.LedStrategy = SW_LED_MODE5;
					padapter->ledpriv.bRegUseLed = _TRUE;
					break;

				case RT_CID_819x_WNC_COREGA:
					padapter->ledpriv.LedStrategy = SW_LED_MODE6;
					padapter->ledpriv.bRegUseLed = _TRUE;
					break;

				default:
					padapter->ledpriv.LedStrategy = SW_LED_MODE0;
					padapter->ledpriv.bRegUseLed = _FALSE;
					break;			
			}
#endif
		}
		else {
			printk("AutoLoad Fail reported from CR9346!!\n");
			AutoloadFail = _FALSE;
		}

		if(	((mac[0]==0xff) &&(mac[1]==0xff) && (mac[2]==0xff)  && (mac[3]==0xff) &&
			(mac[4]==0xff) &&(mac[5]==0xff) ) || 
			((mac[0]==0x0) &&(mac[1]==0x0) && (mac[2]==0x0)  && (mac[3]==0x0) &&
			(mac[4]==0x0) &&(mac[5]==0x0)) || (AutoloadFail == _FALSE))
		{
		mac[0]=0x00;
		mac[1]=0xe0;
		mac[2]=0x4c;
		mac[3]=0x87;
		mac[4]=0x00;
		mac[5]=0x00;
		}
	
		_memcpy(pnetdev->dev_addr, mac/*padapter->eeprompriv.mac_addr*/, ETH_ALEN);

		 printk("MAC Address from efuse= %x-%x-%x-%x-%x-%x\n", 
			mac[0],mac[1],mac[2],mac[3], mac[4], mac[5]);		
	}	
#endif

