OpenHMR/Open-HMR600/Src/linux-2.6.12/drivers/net/wireless/realtek/rtl8712/os_intf/linux/usb_intf.c
	//step 6.
	/* Tell the network stack we exist */
	if (register_netdev(pnetdev) != 0) {
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("register_netdev() failed\n"));
		goto error;
	}
	
	_spinlock_init( &padapter->lockRxFF0Filter );
	
  	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-drv_init - Adapter->bDriverStopped=%d, Adapter->bSurpriseRemoved=%d\n",padapter->bDriverStopped, padapter->bSurpriseRemoved));
  	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-871x_drv - drv_init, success!\n"));
	//printk("-871x_drv - drv_init, success!\n");

#ifdef RTK_DMP_PLATFORM
	rtl8712_proc_init_one(pnetdev);
#endif

#ifdef CONFIG_HOSTAPD_MODE
	hostapd_mode_init(padapter);
#endif	

#ifdef CONFIG_PLATFORM_RTD2880B
	printk("wlan link up\n");
	rtd2885_wlan_netlink_sendMsg("linkup", "8712");	
#endif	

  	return 0;

error:	      

	usb_put_dev(udev);//decrease the reference count of the usb device structure if driver fail on initialzation

	usb_set_intfdata(pusb_intf, NULL);

   	if(padapter->dvobj_deinit==NULL){
		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("\n Initialize dvobjpriv.dvobj_deinit error!!!\n"));
	}else{
		padapter->dvobj_deinit(padapter);
	} 	  

	if(pnetdev)
	{
		//unregister_netdev(pnetdev);
		free_netdev(pnetdev);
	}

	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-871x_sdio - drv_init, fail!\n"));
	//printk("-871x_sdio - drv_init, fail!\n");

	return -ENODEV;

}

/*
 * dev_remove() - our device is being removed
*/
#if 0
static void r871xu_dev_remove(struct usb_interface *pusb_intf)
{	
	_irqL irqL;
	struct net_device *pnetdev=usb_get_intfdata(pusb_intf);	
     _adapter *padapter = (_adapter*)netdev_priv(pnetdev);
	 struct	mlme_priv *pmlmepriv = &padapter->mlmepriv;

_func_exit_;

	if(padapter)	
	{
       		RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+dev_remove()\n"));
		
		pnetdev= (struct net_device*)padapter->pnetdev;	
      		
		padapter->bSurpriseRemoved = _TRUE;	 
     
    		if(pnetdev)   
     		{
        		netif_carrier_off(pnetdev);
     	  		netif_stop_queue(pnetdev);
     		}

		rtl871x_intf_stop(padapter);			
		stop_drv_threads(padapter);

		// indicate-disconnect if necssary (free all assoc-resources)
		// dis-assoc from assoc_sta (optional)			
		_enter_critical(&pmlmepriv->lock, &irqL);
		if(check_fwstate(pmlmepriv, _FW_LINKED)== _TRUE) 
		{
			indicate_disconnect(padapter); //will clr Linked_state; before this function, we must have chked whether  issue dis-assoc_cmd or not		
		}
		_exit_critical(&pmlmepriv->lock, &irqL);
			
		//todo:wait until fw has process dis-assoc cmd		


		r871x_dev_unload(padapter);		
			
	}
	
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-dev_remove()\n"));

_func_exit_;	

	return;
	
}
#else
//rmmod module & unplug(SurpriseRemoved) will call r871xu_dev_remove() => how to recognize both
static void r871xu_dev_remove(struct usb_interface *pusb_intf)
{		
	struct net_device *pnetdev=usb_get_intfdata(pusb_intf);	
	struct usb_device	*udev = interface_to_usbdev(pusb_intf);
       _adapter *padapter = (_adapter*)netdev_priv(pnetdev);
   
_func_exit_;

	usb_set_intfdata(pusb_intf, NULL);

	if(padapter)	
	{
		printk("+r871xu_dev_remove\n");
       	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+dev_remove()\n"));		
      		
#ifdef CONFIG_HOSTAPD_MODE
		hostapd_mode_unload(padapter);
#endif	
			
		if(drvpriv.drv_registered == _TRUE)
		{
			//printk("r871xu_dev_remove():padapter->bSurpriseRemoved == _TRUE\n");
		        padapter->bSurpriseRemoved = _TRUE;	 
		}
		/*else
		{
			//printk("r871xu_dev_remove():module removed\n");
			padapter->hw_init_completed = _FALSE;
		}*/

		if(pnetdev != NULL) {
			unregister_netdev(pnetdev); //will call netdev_close()

#ifdef RTK_DMP_PLATFORM
			rtl8712_proc_remove_one(pnetdev);
#endif
		}

#if LINUX_VERSION_CODE < KERNEL_VERSION(2,5,0)	/* kernel 2.4 series */
#else
		flush_scheduled_work();
#endif
		udelay_os(1);

		r871x_dev_unload(padapter);

		free_drv_sw(padapter);
	}

	usb_put_dev(udev);//decrease the reference count of the usb device structure when disconnect
		
	//If we didn't unplug usb dongle and remove/insert modlue, driver fails on sitesurvey for the first time when device is up . 
	//Reset usb port for sitesurvey fail issue. 2009.8.13, by Thomas
	if(udev->state != USB_STATE_NOTATTACHED)
		usb_reset_device(udev);
	
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("-dev_remove()\n"));
	printk("-r871xu_dev_remove, hw_init_completed=%d\n", padapter->hw_init_completed);

#ifdef CONFIG_PLATFORM_RTD2880B
	printk("wlan link down\n");
	rtd2885_wlan_netlink_sendMsg("linkdown", "8712");	
#endif	
	

_func_exit_;	

	return;
	
}
#endif

static int __init r8712u_drv_entry(void)
{
#ifdef RTK_DMP_PLATFORM
	rtl8712_proc=create_proc_entry(RTL819xU_MODULE_NAME, S_IFDIR, proc_net);
	if (rtl8712_proc == NULL) {
		printk(KERN_ERR "Unable to create rtl8712_proc directory\n");
	}
#endif
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+r8712u_drv_entry\n"));
	drvpriv.drv_registered = _TRUE;
	return usb_register(&drvpriv.r871xu_drv);	
}

static void __exit r8712u_drv_halt(void)
{
	RT_TRACE(_module_hci_intfs_c_,_drv_err_,("+r8712u_drv_halt\n"));
	printk("+r8712u_drv_halt\n");
	drvpriv.drv_registered = _FALSE;
	usb_deregister(&drvpriv.r871xu_drv);
	printk("-r8712u_drv_halt\n");
#ifdef RTK_DMP_PLATFORM
	if(rtl8712_proc){
		remove_proc_entry(RTL819xU_MODULE_NAME, proc_net);
		rtl8712_proc = NULL;
	}
#endif
}


module_init(r8712u_drv_entry);
module_exit(r8712u_drv_halt);


/*
init (driver module)-> r8712u_drv_entry
probe (sd device)-> r871xu_drv_init(dev_init)
open (net_device) ->netdev_open
close (net_device) ->netdev_close
remove (sd device) ->r871xu_dev_remove
exit (driver module)-> r8712u_drv_halt
*/


/*
r8711s_drv_entry()
r8711u_drv_entry()
r8712s_drv_entry()
r8712u_drv_entry()
*/

